In [2]:
import pandas as pd 
import numpy as np
from pandas import Series,DataFrame

In [12]:
dframe1 = DataFrame(np.arange(8).reshape(2,4),
                    index=pd.Index(['LA','SF'],name='city'),
                    columns=pd.Index(['A','B','C','D'],name='letter'))

In [13]:
dframe1

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [15]:
dframe_st = dframe1.stack()
dframe_st
#stack method

city  letter
LA    A         0
      B         1
      C         2
      D         3
SF    A         4
      B         5
      C         6
      D         7
dtype: int32

In [16]:
#back to dataframe
dframe_st.unstack()

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [17]:
dframe_st.unstack('city')

city    LA  SF
letter
A        0   4
B        1   5
C        2   6
D        3   7

In [18]:
#how stack and unstack handle Null Values
ser1 = Series([0,1,2,3],index=['A','B','C','D'])
ser2 = Series([4,5,6,7],index=['Z','W','Y','X'])

In [19]:
dframe = pd.concat([ser1,ser2],keys=['Alpha','Beta'])
dframe

Alpha  A    0
       B    1
       C    2
       D    3
Beta   Z    4
       W    5
       Y    6
       X    7
dtype: int64

In [20]:
dframe.unstack()

         A    B    C    D    W    X    Y    Z
Alpha  0.0  1.0  2.0  3.0  NaN  NaN  NaN  NaN
Beta   NaN  NaN  NaN  NaN  5.0  7.0  6.0  4.0

In [21]:
#removing NaN values
dframe.unstack().stack()

Alpha  A    0.0
       B    1.0
       C    2.0
       D    3.0
Beta   W    5.0
       X    7.0
       Y    6.0
       Z    4.0
dtype: float64

In [22]:
dframe = dframe.unstack()

In [23]:
dframe

         A    B    C    D    W    X    Y    Z
Alpha  0.0  1.0  2.0  3.0  NaN  NaN  NaN  NaN
Beta   NaN  NaN  NaN  NaN  5.0  7.0  6.0  4.0

In [24]:
dframe.stack()

Alpha  A    0.0
       B    1.0
       C    2.0
       D    3.0
Beta   W    5.0
       X    7.0
       Y    6.0
       Z    4.0
dtype: float64

In [25]:
dframe.stack(dropna=False)
#keeping Null Values

Alpha  A    0.0
       B    1.0
       C    2.0
       D    3.0
       W    NaN
       X    NaN
       Y    NaN
       Z    NaN
Beta   A    NaN
       B    NaN
       C    NaN
       D    NaN
       W    5.0
       X    7.0
       Y    6.0
       Z    4.0
dtype: float64